Artillery (Load Tester)/NodeResults20kps.txt
(Tries to send 20000 requests per second)

Report @ 10:52:15(+0200) 2020-09-13
Elapsed time: 7 minutes, 42 seconds
  Scenarios launched:  450
  Scenarios completed: 457
  Requests completed:  457
  Mean response/sec: 232.99
  Response time (msec):
    min: 1.2
    max: 59.2
    median: 12.2
    p95: 22.8
    p99: 43.4
  Codes:
    200: 457

All virtual users finished
Summary report @ 10:52:16(+0200) 2020-09-13
  Scenarios launched:  200000
  Scenarios completed: 200000
  Requests completed:  200000
  Mean response/sec: 431.82
  Response time (msec):
    min: 1.2
    max: 183.6
    median: 9
    p95: 14.9
    p99: 22.8
  Scenario counts:
    0: 200000 (100%)
  Codes:
    200: 200000